app/views/tags/index.html.erb

<td width="20%">Contacts</td><td>
<% @tag.kontakts.each do |kontakt|%>
---
SELECT * FROM "kontakts" INNER JOIN "kontakts_tags" ON "kontakts".id = "kontakts_tags".kontakt_id WHERE ("kontakts_tags".tag_id = 8 )