app/controllers/kontakts_controller.rb

SELECT * FROM "kontakts" WHERE (name LIKE '%%' AND user_id = 3)
SELECT "kontakts".* FROM "kontakts" WHERE ("kontakts"."id" = 18) LIMIT 1
SELECT * FROM "tags" INNER JOIN "kontakts_tags" ON "tags".id = "kontakts_tags".tag_id WHERE ("kontakts_tags".kontakt_id = 14 )
---
  def index
    #@kontakts = Kontakt.all
	@kontakts = Kontakt.search(params[:search], current_user.id)
	#@kontakt_names = []
	#@kontakts.each{|kontakt|
	#@kontakt_names.push(kontakt.name)
	#}
	@k_id = params[:k_id]
	unless @k_id.nil?
		@kontakt = Kontakt.find(@k_id)
		@tags = @kontakt.tags
		@tag_names = []
  		@tags.each{|tag|

SELECT "kontakts".* FROM "kontakts" WHERE ("kontakts"."id" = 18) LIMIT 1
SELECT * FROM "tags" INNER JOIN "kontakts_tags" ON "tags".id = "kontakts_tags".tag_id WHERE ("kontakts_tags".kontakt_id = 6 )
---
  def show
    @kontakt = Kontakt.find(params[:id])
	@tags = @kontakt.tags
	@tag_names = []
  	@tags.each{|tag|

SELECT * FROM "tags" WHERE (name LIKE '%job%' AND user_id = 2)
---
  def new

    @kontakt = Kontakt.new
	@tags = @kontakt.tags
	@new_tags = Tag.search(nil, current_user.id)-@tags

SELECT "kontakts".* FROM "kontakts" WHERE ("kontakts"."id" = 18) LIMIT 1
---
  def edit
    @kontakt = Kontakt.find(params[:id])

INSERT INTO "kontakts" ("user_id", "name", "lastname", "firstname", "middlename", "email", "phone_number", "address", "created_at", "updated_at", "users_id") VALUES(NULL, 'name1', 'lasnmae1', NULL, NULL, NULL, NULL, 'addrrs', '2010-09-14 17:56:56', '2010-09-14 17:56:56', NULL)
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 15) LIMIT 1
SELECT * FROM "kontakts"
---
  def create
  	#Kontakt {"name"=>"sdfds", "lastname"=>"sdfsdf", "address"=>"fds fsd", "tags_attributes"=>{"0"=>{"name"=>"metka1 metka2"}}} was successfully created.

    @kontakt = Kontakt.new(params[:kontakt])
 	#tt = eval(params[:tags])
 	params[:tagids] ||=[]
 	params[:tagids].each{|tagid|
 	@kontakt.tags.push(Tag.find(tagid))
 	}
	@kontakt['user_id'] = current_user.id
	@kontakt['name'] = (params[:kontakt][:lastname].to_s+" "+params[:kontakt][:firstname].to_s + " "+ params[:kontakt][:middlename].to_s).strip if @kontakt['name'].blank?

SELECT "kontakts".* FROM "kontakts" WHERE ("kontakts"."id" = 18) LIMIT 1
UPDATE "kontakts" SET "name" = 'Иванов', "lastname" = 'Иванов', "firstname" = 'Иван', "middlename" = 'Петрович', "address" = 'ул. Главная 5, кв.25', "updated_at" = '2010-09-15 00:04:28' WHERE "id" = 7
---
  def update
    @kontakt = Kontakt.find(params[:id])

    respond_to do |format|
      if @kontakt.update_attributes(params[:kontakt])

SELECT "kontakts".* FROM "kontakts" WHERE ("kontakts"."id" = 18) LIMIT 1
DELETE FROM "kontakts" WHERE ("kontakts"."id" = 18)
---
  def destroy
    @kontakt = Kontakt.find(params[:id])
    @kontakt.destroy

SELECT * FROM "kontakts" WHERE (user_id = 2)
SELECT * FROM "tags" WHERE (user_id = 2)
---
  def tag_filter
  	@kontakts = Kontakt.search(params[:search], current_user.id)
  	@tags = Tag.search(params[:search], current_user.id)

SELECT "tags".* FROM "tags" WHERE (id = '15' AND user_id = '7')
SELECT * FROM "kontakts" WHERE (user_id = 2)
---
  def add_tag
  	@tags = Tag.find_tag(params[:id], current_user.id)
  	flash[:notice] = "add_tag #{params}"
  	render :partial => "kontakts/showtags"
  end

end


#Kontakt.find_by_name('name1')
#Kontakt.find_all_by_address('addree, 4')
#
#
#Kontakt.find_all_by_address('addree, 4', :order=>'created_at DESC')

=begin
<select id="editlevel" name="editlevel" onchange="
   <%= remote_function(
           :update => 'lques',
           :url => {:action => :lques},
           :with => "'level=' + $('editlevel').value %>
">

</select>

<select id="lques" name="lques">
</select>


<% form_for :category, :url => { :action => "show" } do |f| %>
  <%= select_tag :id, options_from_collection_for_select(Category.find(:all), :id, :name),
  { :onchange => "this.form.submit();"} %>
<% end %>


<% form_for :kontakt, :url => { :action => "new" } do |f| %>
  <%= select_tag :id, options_from_collection_for_select(Tag.find(:all), :id, :name),
  { :onchange => "this.form.submit();"} %>