app/controllers/tags_controller.rb

SELECT * FROM "tags" WHERE (name LIKE '%fa%' AND user_id = 2)
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 8) LIMIT 1
SELECT * FROM "kontakts" INNER JOIN "kontakts_tags" ON "kontakts".id = "kontakts_tags".kontakt_id WHERE ("kontakts_tags".tag_id = 3 )
---
  def index

  	@tags = Tag.search(params[:search], current_user.id)

	@t_id = params[:t_id]
	unless @t_id.nil?
		@tag = Tag.find(@t_id)
		@kontakts = @tag.kontakts
		@kontakt_names = []
  		@kontakts.each{|tag|

SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 7) LIMIT 1
SELECT * FROM "kontakts" INNER JOIN "kontakts_tags" ON "kontakts".id = "kontakts_tags".kontakt_id WHERE ("kontakts_tags".tag_id = 3 )
---
  def show
    @tag = Tag.find(params[:id])
	@kontakts = @tag.kontakts
	@kontakt_names = []
  	@kontakts.each{|kontakt|

SELECT * FROM "tags" WHERE ("tags"."id" = 4)
---
  def edit
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("kontakts_id", "name", "user_id") VALUES (NULL, 'xcc', 5)
---
  def create
  	#Kontakt {"name"=>"sdfds", "lastname"=>"sdfsdf", "address"=>"fds fsd", "tags_attributes"=>{"0"=>{"name"=>"metka1 metka2"}}} was successfully created.

    @tag = Tag.new(params[:tag])
	@tag['user_id'] = current_user.id

    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 7) LIMIT 1
DELETE FROM "tags" WHERE ("tags"."id" = 7)
---
  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy