app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    #success = @user && @user.save
    if verify_recaptcha
    	success =  @user && @user.save
    	if success && @user.errors.empty?
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "login", "name", "remember_token", "remember_token_expires_at", "salt", "updated_at") VALUES ('2010-09-19 00:44:14.974327', '320dd3575409faa296079ed03c618ff0a3509d13', 'fsdfdds@mail.ru', 'dsfdsfd', '', NULL, NULL, '9fde617447a50571c72dd6f90682404b17bbf335', '2010-09-19 00:44:14.974327')
SELECT * FROM "users"